# ElementWorksetFilter Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementWorksetFilter Constructor
ElementWorksetFilter Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementWorksetFilter(WorksetId) | Constructs a new instance of a filter to match elements in a given workset. |
| ElementWorksetFilter(WorksetId, Boolean) | Constructs a new instance of a filter to match elements in a given workset. |

# See Also
ElementWorksetFilter Class
ElementWorksetFilter Members
Autodesk.Revit.DB Namespace